# MinimumYieldStress Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralAsset..::..MinimumYieldStress Property
StructuralAsset Class See Also
---
The minimum yield stress of the asset.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double MinimumYieldStress { get; set; }
```

Visual Basic
---
```text
Public Property MinimumYieldStress As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double MinimumYieldStress {
	double get ();
	void set (double value);
}
```

# Remarks
Applies to Metal-based and generic structural assets. The value is in Newtons per foot meter (N/(ft · m)).
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InapplicableDataException | When setting this property: the material type must be Metal or generic to set this property. |

# See Also
StructuralAsset Class
Autodesk.Revit.DB Namespace